modm-ext/data.modm.io/docs/svd/header_stm32f105xc.svd
        <register>
          <name>SMPR1</name>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SMP10</name>
              <description>ADC channel 10 sampling time selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP11</name>
              <description>ADC channel 11 sampling time selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP12</name>
              <description>ADC channel 12 sampling time selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP13</name>
              <description>ADC channel 13 sampling time selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP14</name>
              <description>ADC channel 14 sampling time selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP15</name>
              <description>ADC channel 15 sampling time selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP16</name>
              <description>ADC channel 16 sampling time selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP17</name>
              <description>ADC channel 17 sampling time selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR2</name>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SMP0</name>
              <description>ADC channel 0 sampling time selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP1</name>
              <description>ADC channel 1 sampling time selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP2</name>
              <description>ADC channel 2 sampling time selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP3</name>
              <description>ADC channel 3 sampling time selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP4</name>
              <description>ADC channel 4 sampling time selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP5</name>
              <description>ADC channel 5 sampling time selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP6</name>
              <description>ADC channel 6 sampling time selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP7</name>
              <description>ADC channel 7 sampling time selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP8</name>
              <description>ADC channel 8 sampling time selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP9</name>
              <description>ADC channel 9 sampling time selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JOFR1</name>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JOFFSET1</name>
              <description>ADC group injected sequencer rank 1 offset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JOFR2</name>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JOFFSET2</name>
              <description>ADC group injected sequencer rank 2 offset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JOFR3</name>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JOFFSET3</name>
              <description>ADC group injected sequencer rank 3 offset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JOFR4</name>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JOFFSET4</name>
              <description>ADC group injected sequencer rank 4 offset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTR</name>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HT</name>
              <description>ADC analog watchdog 1 threshold high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LTR</name>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LT</name>
              <description>ADC analog watchdog 1 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR1</name>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SQ13</name>
              <description>ADC group regular sequencer rank 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ14</name>
              <description>ADC group regular sequencer rank 14</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ15</name>
              <description>ADC group regular sequencer rank 15</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ16</name>
              <description>ADC group regular sequencer rank 16</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>L</name>
              <description>ADC group regular sequencer scan length</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>ADC group regular sequencer disable (equivalent to sequencer of 1 rank: ADC conversion on only 1 channel)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_2RANKS</name>
                  <description>ADC group regular sequencer enable with 2 ranks in the sequence</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_3RANKS</name>
                  <description>ADC group regular sequencer enable with 3 ranks in the sequence</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_4RANKS</name>
                  <description>ADC group regular sequencer enable with 4 ranks in the sequence</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_5RANKS</name>
                  <description>ADC group regular sequencer enable with 5 ranks in the sequence</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_6RANKS</name>
                  <description>ADC group regular sequencer enable with 6 ranks in the sequence</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_7RANKS</name>
                  <description>ADC group regular sequencer enable with 7 ranks in the sequence</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_8RANKS</name>
                  <description>ADC group regular sequencer enable with 8 ranks in the sequence</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_9RANKS</name>
                  <description>ADC group regular sequencer enable with 9 ranks in the sequence</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_10RANKS</name>
                  <description>ADC group regular sequencer enable with 10 ranks in the sequence</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_11RANKS</name>
                  <description>ADC group regular sequencer enable with 11 ranks in the sequence</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_12RANKS</name>
                  <description>ADC group regular sequencer enable with 12 ranks in the sequence</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_13RANKS</name>
                  <description>ADC group regular sequencer enable with 13 ranks in the sequence</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_14RANKS</name>
                  <description>ADC group regular sequencer enable with 14 ranks in the sequence</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_15RANKS</name>
                  <description>ADC group regular sequencer enable with 15 ranks in the sequence</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_16RANKS</name>
                  <description>ADC group regular sequencer enable with 16 ranks in the sequence</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR2</name>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SQ7</name>
              <description>ADC group regular sequencer rank 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ8</name>
              <description>ADC group regular sequencer rank 8</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ9</name>
              <description>ADC group regular sequencer rank 9</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ10</name>
              <description>ADC group regular sequencer rank 10</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ11</name>
              <description>ADC group regular sequencer rank 1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ12</name>
              <description>ADC group regular sequencer rank 12</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR3</name>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SQ1</name>
              <description>ADC group regular sequencer rank 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ2</name>
              <description>ADC group regular sequencer rank 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ3</name>
              <description>ADC group regular sequencer rank 3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ4</name>
              <description>ADC group regular sequencer rank 4</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ5</name>
              <description>ADC group regular sequencer rank 5</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ6</name>
              <description>ADC group regular sequencer rank 6</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JSQR</name>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JSQ1</name>
              <description>ADC group injected sequencer rank 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ2</name>
              <description>ADC group injected sequencer rank 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ3</name>
              <description>ADC group injected sequencer rank 3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ4</name>
              <description>ADC group injected sequencer rank 4</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JL</name>
              <description>ADC group injected sequencer scan length</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>ADC group injected sequencer disable (equivalent to sequencer of 1 rank: ADC conversion on only 1 channel)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_2RANKS</name>
                  <description>ADC group injected sequencer enable with 2 ranks in the sequence</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_3RANKS</name>
                  <description>ADC group injected sequencer enable with 3 ranks in the sequence</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_4RANKS</name>
                  <description>ADC group injected sequencer enable with 4 ranks in the sequence</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR1</name>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 1 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR2</name>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 2 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR3</name>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 3 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR4</name>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 4 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>ADC group regular conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ADC2DATA</name>
              <description>ADC group regular conversion data for ADC slave, in multimode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
